<@layout flag="owners">
<p>owners page</p>
<p>Σελίδα​ ​Owner:​ ​Θα​ ​περιέχει​ ​τις​ ​εξής​ ​λειτουργίες:​ ​Αναζήτηση,​ ​Δημιουργία, </p>
<p>Διαγραφή,​ ​Ενημέρωση.  </p>
<p>○ Δημιουργία:​ ​Θα​ ​εμφανίζεται​ ​φόρμα​ ​με​ ​τα​ ​εξής​ ​πεδία:​ ΑΦΜ​ (χαρακτηρίζει </p>
<p>μοναδικά​ ​τους​ ​χρήστες),​ ​​ Όνομα,​ Επίθετο,​ διεύθυνση,​ email,​ κωδικό </p>
<p>χρήστη,​ μάρκα​ ​οχήματος,​ τύπο​ ​χρήστη​ ​(Διαχειριστής,​ ​Χρήστης) </p>
<p>○ Αναζήτηση:​ ​Θα​ ​περιέχει​ ​τα​ ​εξής​ ​πεδία​ ​προς​ ​αναζήτηση:​ ΑΦΜ​ κ​ email </p>
<p>○ Ενημέρωση:​ ​Σε​ ​ξεχωριστή​ ​σελίδα,​ ​θα​ ​εμφανίζονται​ ​τα​ ​πλήρη​ ​στοιχεία​ ​ενός</p> 
<p>χρήστη​ ​και​ ​θα​ ​μπορεί​ ​ο​ ​διαχειριστής​ ​να​ ​τα​ ​τροποποιεί.​ ​Το​ ​navigation​ ​στην </p>
<p>σελίδα​ ​μπορεί​ ​να​ ​γίνει​ ​με​ ​αντίστοιχο​ ​link​ ​στην​ ​σελίδα​ ​της​ ​αναζήτησης. </p>
<p>○ Διαγραφή:​ ​Μέσω​ ​της​ ​σελίδας​ ​της​ ​ενημέρωσης,​ ​θα​ ​παρέχεται​ ​ειδικό​ ​κουμπί </p>
<p>που​ ​θα​ ​επιτρέπει​ ​αυτή​ ​τη​ ​λειτουργία.​ ​Προτείνεται​ ​με​ ​το​ ​πάτημα​ ​του </p>
<p>κουμπιού​ ​να​ ​πετάγεται​ ​Javascript​ ​παράθυρο​ ​για​ ​επιβεβαίωση​ ​της​ ​ενέργειας. </p>
</@layout>